{
  "Previous": {
    "Events": [
      {
        "name": "Electrovision",
        "content": "Hey ECE geeks come and test your knowledge in this fun event. Play with everything from basic circuits to computers. Make the computer of your dreams and compete with others. May the best PC win!",
        "images": "/Assets/Events/electrovision.webp",
        "round1head": "• Round 1: Website Based Game",
        "round2head": "• Round 2: Circuit Designing",
        "round3head": "• Round 3: PC Building",
        "round4head": "• Tie Breaker: Logic Based Puzzle",
        "round1": "A binary number based game that would be available on Vibhav's official website to play.",
        "round2": "Participants will have to design circuits with the help of given logic gates to get the required outputs.",
        "round3": "In this round, participants have to build a PC from scratch with a simulator.",
        "round4": "A logic based puzzle will be given to solve."
      },
      {
        "name": "Cyber Circuits",
        "content": "Channelize your inner Sherlock Holmes and find clues hidden all over our social media outlets starting from YouTube to all the way over to Instagram and also enjoy many electronics based competitions and win huge prizes. See you there!",
        "images": "/Assets/Events/cybercircuits.webp",
        "round1head": "• Round 1: Puzzle Round",
        "round2head": "• Round 2: Circuit Debugging",
        "round3head": "• Round 3: Social Media Hunt",
        "round1": "This round involves solving a word sleuth related to electronics.",
        "round2": "A complicated non-functional circuit will be provided to debug.",
        "round3": "Participants will have to find components on social media using the hints provided and perform the given task in the minimum time."
      },
      {
        "name": "QuanrenTeam Titans",
        "content": "Walkthrough the breath-taking virtual campus of NITH, solve mind-boggling puzzles, and emerge as the champion! Join the mega hunt to win amazing prizes.",
        "images": "/Assets/Events/event 3.webp",
        "round1head": "• Round 1: Treasure Hunt",
        "round2head": "• Round 2: Mathematical Puzzle",
        "round3head": "• Round 3: Instant Innovation",
        "round1": "In the first round, participants have to find the clues hidden in the virtual NITH and the player has to collect the specified number of gems from different checkpoints in the minimum time.",
        "round2": "Kakuro, a mathematical transliteration crossword will be given to solve but with a twist.",
        "round3": "Instant Innovation, in a nutshell, means raising start-up from the news. It will provide the contestants an opportunity to think about how to find a problem, ideate its solution, and pitch."
      }
    ],

    "Workshops": [
      {
        "name": "PCB Designing",
        "content": "EAGLE is electronic design automation (EDA) software that lets printed circuit board (PCB) designers seamlessly connect schematic diagrams, component placement, PCB routing, and comprehensive library content. Bringing the design to life with a wide range of PCB layout tools in EAGLE.",
        "images": "/Assets/Workshop/pcb.webp",
        "round1": "EAGLE is electronic design automation (EDA) software that lets printed circuit board (PCB) designers seamlessly connect schematic diagrams, component placement, PCB routing, and comprehensive library content. Bringing the design to life with a wide range of PCB layout tools in EAGLE. Printed circuit board design brings the electronic circuits to life in the physical form. Using layout software, the PCB design process combines component placement and routeing to define electrical connectivity on a manufactured circuit board.",
        "round2": "Using ECAD-MCAD integration between EAGLE and Fusion 360 makes it easy to share the PCB design and verify fit in a physical enclosure."
      },
      {
        "name": "VR Gaming",
        "content": "The workshop will start by introducing the students with multiverse. Then we will explain the basics of blender which will include 3-D modelling of the basic environment required in the game. Next we will go over the basics of vr. Lastly we will write our code to complete the game.",
        "images": "/Assets/Workshop/vr_gaming.webp",
        "round1": "The workshop will start by introducing the students with multiverse. Then we will explain the basics of blender which will include 3-D modelling of the basic environment required in the game. Next we will go over the basics of vr.",
        "round2": "Lastly we will write our code to complete the game. In this workshop we will teach about how the basic games are build and through this they will be able to relate with the theme metaverse in future."
      },
      {
        "name": "QUANTUM COMPUTING",
        "content": "In many applications it is important to find the minimum eigenvalue of a matrix. For example, in chemistry, the minimum eigenvalue of a Hermitian matrix characterizing the molecule is the ground state energy of that system. In the future, the quantum phase estimation algorithm may be used to find the minimum eigenvalue.",
        "images": "/Assets/Workshop/quantum2.webp",
        "round1": "In many applications it is important to find the minimum eigenvalue of a matrix. For example, in chemistry, the minimum eigenvalue of a Hermitian matrix characterizing the molecule is the ground state energy of that system. In the future, the quantum phase estimation algorithm may be used to find the minimum eigenvalue. However, its implementation on useful problems requires circuit depths exceeding the limits of hardware available in the NISQ era. In this workshop we will use the VQE algorithm to simulate the ground state energy of a diatomic molecule which is nearly impossible to simulate classically."
      }
    ]
  },
  "Current": {
    "Events": [
      {
        "name": "Striker's Edge",
        "content": "Experience the thrill of solving logic puzzles, playing chess with a litttle twist and pitching ideas.Compete with your friends to come out on the top.",
        "images": "/Assets/Events/insti-event.webp",
        "round1head": "• Round 1 : Nonogram",
        "round1": "Nonogram is a picture logic puzzle. To disclose a concealed picture, cells in a grid must be coloured or left blank according to the alphabet on the side of the grid, just like mine sweeper. In this puzzle type, an alphabet is a form of discrete tomography that measures how many unbroken lines of filled-in squares are in any given row or column. After all the alphabet or letters are recognized, it will lead to a location on the campus, which participants must find out. It will be a time-based task.",
        "round2head": "• Round 2 : Bishopblitz",
        "round2": "In this game, participants must take the horse piece from start to finish point given on the board.",
        "round3head": "The rules are:",
        "round3": "The horse will cover 2.5 blocks in one step. While taking our horse from start to finish point, they must take the minimum number of steps in doing so. They must drop out the other colour board pieces in which the King piece is a must and collect the maximum number of points in doing so.",
        "round4head": "• Round 3 : Idea Pitching",
        "round4": "Players will be provided with a newsletter containing different articles. Each article will have problem statements hidden in them. Players will find hidden problem statements and pitch any sort of detailed solution. The best idea solution will be the winner."
      },
      {
        "name": "Ohm's Odyssey",
        "content": "Experience the thrill of dart games, riddle solving and traditional snake & ladder games with a twist of electronics integrated into it. Compete against your friends to earn more points and come out on top.",
        "images": "/Assets/Events/ohm's_odyssey.webp",
        "round1head": "• Round 1 : Riddle Quest",
        "round1": "Riddle Coding Teams of two participants will be assigned, and they will each receive four distinct puzzles to solve. Each team will receive a unique set of puzzles, with a colour as the solution. They'll get three more riddles to decode the sequence. The teams must figure out all four puzzles to receive a colour code. According to the resistor color coding they have to give the value of the resistor.",
        "round2head": "• Round 2 : Lumidarts",
        "round2": "Teams of four participants will be divided, and each team will be given a circuit to figure out how much resistance to add so that the LED does not ignite. Then, each team will be given a total of 16 chances—4 for each player—to throw a dart onto a coloured dartboard and cross the resistance value's lower limit."
      },
      {
        "name": "Boolean Blitz",
        "content": "Enjoy playing mind games with a blend of Electronics. Use simples permutations and basic knowledge of circuits to win against your opponents. Enjoy the game and win exciting prizes.",
        "images": "/Assets/Events/boolean_blitz.webp",
        "round1head": "• Round 1 : Asciitary",
        "round1": " There is a given MIMO digital circuit with a blank space for a circuit component which will be a logic gate. The circuit will be of two phases first will convert character to ASCII code and second will consist of a logic gate with one blank gate. Player will feed in his alphabets in the ASCII converter. The objective of the game is to choose the right logic gate which leads to max output in the given digital circuit.",
        "round2head": "• Round 2 : Logiricks",
        "round2": "There will be a 4×4 Grid and every box will be named from 1 to 16. Every participant has to start from box 1. Each box will contain a digital circuit (consisting of logic gates) with 2 inputs and unique solution of output 1. Participants have to apply the input which gives 1 as output. After solving 16 boxes, according to the time taken and shortcut trick used, the result will be declared."
      }
    ],

    "Workshops": [
      {
        "name": "Neural Networks",
        "content": "Neural networks are able to learn from data and use it to inform their predictions, choices, and solutions. They are being used in a variety of tasks, such as image identification, natural language processing, and more, and are becoming an effective tool for resolving challenging issues.",
        "images": "/Assets/Workshop/neural_network.webp",
        "round1head": "Team Vibhav invites you to an exciting workshop on the futuristic technology of Neuralink. Join us for an engaging session where we will explore the brain-computer interface technology. In this workshop, you will learn about the basics of Neuralink, including its potential applications and the science behind it. You will also witness practical demonstrations of the technology, discuss the ethical and social implications, and explore the future possibilities of Neuralink.",
        "round1": "Whether you're an up to date person or just someone curious about the latest technology, this workshop is perfect for you. Don't miss this opportunity to learn about one of the most groundbreaking and revolutionary technologies of our time. Join us to enjoy the joy of learning."
      },
      {
        "name": "Simulink",
        "content": "Simulink is a graphical programming environment used for dynamic system modelling, simulation, and analysis. Many uses for it exist, including automatic control and signal processing. The fundamental ideas and uses of Simulink will be covered in this workshop.",
        "images": "/Assets/Workshop/simulink.webp",
        "round1head": "Team Vibhav is delighted to offer a workshop on Simulink, an essential tool for modeling, simulating, and analyzing dynamic systems. The workshop will cover a wide range of topics, including creating models, adding blocks, running simulations, and exploring Simulink's advanced features such as Model Explorer, Signal Editor, and Simulation Data Inspector.",
        "round1": "Our experienced professionals will conduct the workshop and provide hands-on training, with real-world examples to enhance participants' learning. By the end of this workshop, participants will have a strong foundation in Simulink and be able to apply their knowledge to diverse engineering applications, making it a must-attend event for engineering enthusiasts.",
        "round2head": "Team Vibhav awaits for your participation. Follow us for more updates …."
      },
      {
        "name": "Verilog",
        "content": "The session will focus on the principles of language, synthesis, modelling, simulation, and verification used in FPGA, ASIC, and embedded system design. Participants will be able to create and test Verilog designs and become more knowledgeable about how to use it in their applications.",
        "images": "/Assets/Workshop/verilog1.webp",
        "round1head": "Team Vibhav is thrilled to announce an upcoming workshop on Verilog, a hardware description language used to design digital circuits. This workshop is ideal for both beginners and experienced Verilog users who are interested in learning more about digital circuit design and improving their skills.",
        "round1": "In this workshop, participants will have the opportunity to gain hands-on experience in writing and simulating Verilog code for various digital circuits. The workshop will cover the fundamentals of Verilog syntax, including data types, module instantiation, behavioral modeling, and testbench creation. Participants will also learn about timing and power analysis of digital circuits using Verilog simulation tools.",
        "round2head": "Join us at this exciting workshop to expand your knowledge of Verilog and become a more confident digital circuit designer. We look forward to seeing you there!"
      }
    ]
  }
}
